/* errAuthorizationInvalidSet */
"-60001" = "授權權利無效。";

/* errAuthorizationInvalidRef */
"-60002" = "授權參考無效。";

/* errAuthorizationInvalidTag */
"-60003" = "授權標籤無效。";

/* errAuthorizationInvalidPointer */
"-60004" = "傳回的授權無效。";

/* errAuthorizationDenied */
"-60005" = "此授權已被拒絕。";

/* errAuthorizationCanceled */
"-60006" = "使用者已經取消認證作業。";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "由於不能進行使用者互動操作，此授權已被拒絕。";

/* errAuthorizationInternal */
"-60008" = "無法取得此項操作的授權。";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "不允許將授權轉換為外部格式。";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "不允許從外部格式製作授權。";

/* errAuthorizationInvalidFlags */
"-60011" = "提供的選項旗幟對於此項授權操作無效。";

/* errAuthorizationToolExecuteFailure */
"-60031" = "無法執行指定的程式。";

/* errAuthorizationToolEnvironmentError */
"-60032" = "執行具有權限的工具期間傳回無效狀態。";

/* errAuthorizationBadAddress */
"-60033" = "要求的 socket 位址無效（必須介於 0-1023）。";

/* errSSLProtocol */
"-9800" = "SSL 通訊協定錯誤";

/* errSSLNegotiation */
"-9801" = "加密演算法協調失敗";

/* errSSLFatalAlert */
"-9802" = "嚴重提示";

/* errSSLWouldBlock */
"-9803" = "I/O 將會阻斷（非嚴重性）";

/* errSSLSessionNotFound */
"-9804" = "嘗試回復未知的區段";

/* errSSLClosedGraceful */
"-9805" = "已完全地中斷連線";

/* errSSLClosedAbort */
"-9806" = "連線因為錯誤而中斷";

/* errSSLXCertChainInvalid */
"-9807" = "無效的憑證鑰匙圈";

/* errSSLBadCert */
"-9808" = "錯誤的認證格式";

/* errSSLCrypto */
"-9809" = "基礎密碼動作錯誤";

/* errSSLInternal */
"-9810" = "內部錯誤";

/* errSSLModuleAttach */
"-9811" = "模組附加失敗";

/* errSSLUnknownRootCert */
"-9812" = "有效的認證鏈、未被信任的 root";

/* errSSLNoRootCert */
"-9813" = "認證鏈尚未由 root 驗證";

/* errSSLCertExpired */
"-9814" = "認證鏈中包含過期的認證";

/* errSSLCertNotYetValid */
"-9815" = "認證鏈中有一個認證尚未有效";

/* errSSLClosedNoNotify */
"-9816" = "伺服器無預警地關閉區段";

/* errSSLBufferOverflow */
"-9817" = "提供的緩衝區不足";

/* errSSLBadCipherSuite */
"-9818" = "錯誤的 SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "接收到未預期的訊息";

/* errSSLPeerBadRecordMac */
"-9820" = "錯誤的 MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "解密失敗";

/* errSSLPeerRecordOverflow */
"-9822" = "記錄溢位";

/* errSSLPeerDecompressFail */
"-9823" = "解壓縮失敗";

/* errSSLPeerHandshakeFail */
"-9824" = "通訊失敗";

/* errSSLPeerBadCert */
"-9825" = "其他的錯誤認證";

/* errSSLPeerUnsupportedCert */
"-9826" = "未支援的錯誤認證格式";

/* errSSLPeerCertRevoked */
"-9827" = "認證撤銷";

/* errSSLPeerCertExpired */
"-9828" = "認證過期";

/* errSSLPeerCertUnknown */
"-9829" = "未知的認證";

/* errSSLIllegalParam */
"-9830" = "不合法的參數";

/* errSSLPeerUnknownCA */
"-9831" = "未知的認證授權";

/* errSSLPeerAccessDenied */
"-9832" = "存取被拒絕";

/* errSSLPeerDecodeError */
"-9833" = "解碼錯誤";

/* errSSLPeerDecryptError */
"-9834" = "解密錯誤";

/* errSSLPeerExportRestriction */
"-9835" = "輸出限制";

/* errSSLPeerProtocolVersion */
"-9836" = "錯誤的協定版本";

/* errSSLPeerInsufficientSecurity */
"-9837" = "不足的安全層級";

/* errSSLPeerInternalError */
"-9838" = "內部錯誤";

/* errSSLPeerUserCancelled */
"-9839" = "使用者已取消";

/* errSSLPeerNoRenegotiation */
"-9840" = "不允許重新協調";

/* errSSLServerAuthCompleted */
"-9841" = "伺服器憑證有效，或是在驗證停用時被忽略";

/* errSSLClientCertRequested */
"-9842" = "伺服器已要求用戶端憑證";

/* errSSLHostNameMismatch */
"-9843" = "對等點主機名稱不相符";

/* errSSLConnectionRefused */
"-9844" = "對等點在回應前已中斷連線";

/* errSSLDecryptionFail */
"-9845" = "解密失敗";

/* errSSLBadRecordMac */
"-9846" = "錯誤的 MAC";

/* errSSLRecordOverflow */
"-9847" = "記錄溢位";

/* errSSLBadConfiguration */
"-9848" = "設定錯誤";

/* errSecSuccess */
"0" = "無錯誤。";

/* errSecUnimplemented */
"-4" = "功能或操作未執行。";

/* errSecParam */
"-50" = "一或多個傳送到函數上的參數無效。";

/* errSecAllocate */
"-108" = "無法配置記憶體。";

/* errSecNotAvailable */
"-25291" = "無鑰匙圈可用。您可能需要重新啟動您的電腦。";

/* errSecReadOnly */
"-25292" = "不能修改此鑰匙圈。";

/* errSecAuthFailed */
"-25293" = "您輸入的使用者名稱和密語不正確。";

/* errSecNoSuchKeychain */
"-25294" = "無法找到指定的鑰匙圈。";

/* errSecInvalidKeychain */
"-25295" = "此指定的鑰匙圈不是有效的鑰匙圈檔案。";

/* errSecDuplicateKeychain */
"-25296" = "已經存在一個有相同名稱的鑰匙圈。";

/* errSecDuplicateCallback */
"-25297" = "已經安裝指定的回撥功能。";

/* errSecInvalidCallback */
"-25298" = "指定的回撥功能無效。";

/* errSecDuplicateItem */
"-25299" = "在鑰匙圈中已經存在指定的項目。";

/* errSecItemNotFound */
"-25300" = "在鑰匙圈中找不到指定的項目。";

/* errSecBufferTooSmall */
"-25301" = "沒有足夠的記憶體來使用指定的項目。";

/* errSecDataTooLarge */
"-25302" = "此項目包含的資訊量太大或是包含的資訊使用無法顯示的格式。";

/* errSecNoSuchAttr */
"-25303" = "指定的屬性不存在。";

/* errSecInvalidItemRef */
"-25304" = "指定的項目已經失效。該項目可能已經從鑰匙圈中刪除。";

/* errSecInvalidSearchRef */
"-25305" = "無法搜尋目前的鑰匙圈。";

/* errSecNoSuchClass */
"-25306" = "指定的項目似乎並非有效的鑰匙圈項目。";

/* errSecNoDefaultKeychain */
"-25307" = "找不到預設鑰匙圈。";

/* errSecInteractionNotAllowed */
"-25308" = "不允許使用者互動操作。";

/* errSecReadOnlyAttr */
"-25309" = "不能修改指定的屬性。";

/* errSecWrongSecVersion */
"-25310" = "此鑰匙圈是由不同版本的系統軟體製作，因此無法打開。";

/* errSecKeySizeNotAllowed */
"-25311" = "此項目指定的鑰匙大小太大。";

/* errSecNoStorageModule */
"-25312" = "一個所需組件（資料儲存模組）不能被載入。您可能需要重新啟動您的電腦。";

/* errSecNoCertificateModule */
"-25313" = "一個所需組件（認證模組）不能被載入。您可能需要重新啟動您的電腦。";

/* errSecNoPolicyModule */
"-25314" = "一個所需組件（規則模組）不能被載入。您可能需要重新啟動您的電腦。";

/* errSecInteractionRequired */
"-25315" = "需要使用者互動操作，但是目前無法使用此類操作。";

/* errSecDataNotAvailable */
"-25316" = "無法檢索此項目中的內容。";

/* errSecDataNotModifiable */
"-25317" = "無法修改此項目中的內容。";

/* errSecCreateChainFailed */
"-25318" = "無法找到啟用此認證所需的一或多個認證。";

/* errSecInvalidPrefsDomain */
"-25319" = "指定的偏好設定網域無效。";

/* errSecACLNotSimple */
"-25240" = "指定的連線權限控制列表不在標準（簡化）表單內。";

/* errSecPolicyNotFound */
"-25241" = "找不到指定的規則。";

/* errSecInvalidTrustSetting */
"-25242" = "指定的信任設定無效。";

/* errSecNoAccessForItem */
"-25243" = "指定的項目不含存取權限控制。";

/* errSecInvalidOwnerEdit */
"-25244" = "更改此項目持有人的嘗試無效。";

/* errSecTrustNotAvailable */
"-25245" = "沒有可用的信任結果";

/* errSecUnsupportedFormat */
"-25256" = "不支援的輸入∕輸出格式。";

/* errSecUnknownFormat */
"-25257" = "未知的輸入格式。";

/* errSecKeyIsSensitive */
"-25258" = "鑰匙的資料必須先經過封裝才能輸出。";

/* errSecMultiplePrivKeys */
"-25259" = "已嘗試輸入多個專用鑰匙。";

/* errSecPassphraseRequired */
"-25260" = "當輸入∕輸出時需要使用密語。";

/* errSecInvalidPasswordRef */
"-25261" = "密碼參考值無效。";

/* errSecInvalidTrustSettings */
"-25262" = "“信任設定記錄”已損毀。";

/* errSecNoTrustSettings */
"-25263" = "找不到“信任設定”。";

/* errSecPkcs12VerifyFailure */
"-25264" = "在輸入 PKCS12 時 MAC 驗證失敗。";

/* errSecDecode */
"-26275" = "無法解碼提供的資料。";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP 暫存區向量錯誤值。";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP 加解密環境錯誤值。";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP 階段加解密 API 錯誤值。";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* 嘗試使用公用密鑰，該密鑰不完整原因是 * 缺乏特定演算法參數。";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "代碼簽名不符";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "密鑰 StartDate∕EndDate 無效";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "“鑰匙圈同步”錯誤碼";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2 填充檢查：偵測到回滾攻擊";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "傳遞到 CSSM_DL_DbCreate 或 CSSM_DL_DbOpen 的引數 OpenParameters 既不是 NULL 值也不是有效 CSSM_APPLEDL_OPEN_PARAMETERS 結構的指標";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "因於磁碟已滿，因此作業失敗";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "某項作業失敗，因為超過磁碟配額";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "由於檔案太大，因此作業失敗";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "鑰匙圈資料庫的內部資訊（“blob”）無效";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "資料庫內部資訊（“blob”）的內部資料格式版本無效";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "主機名稱不相符";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "無法辨識標記為“重要”true 值的擴充欄位";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "每項規則都需要“基本限制”擴充欄位，但未顯示";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "無效的基本限制.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "無效的授權密鑰識別碼";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "無效的主題密鑰識別碼 ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "無效的規則密鑰使用";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "無效的規則延伸密鑰使用";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "無效的主題∕授權密鑰識別碼連結";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "已超過 PathLengthConstraint";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "憑證群組終止在無法自行驗證的根憑證";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL 已過期∕尚未生效";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "找不到合適的 CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "指定的 CRL 伺服器關機";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "難以識別的 CRL 分配點 URL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "未知的重要憑證∕CRL 擴充欄位";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "錨或根憑證無法驗證的 CRL";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL 驗證為不受信任的根憑證";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL 驗證政策失敗";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "違反 IssuingDistributionPoint 擴充欄位";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "未在指定的 issuerAltName 上找到憑證";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "從指定的 issuerAltName 取得的憑證是錯誤的";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME 電子郵件位址不符";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "沒有找到適當的“S/MIME 延伸密鑰使用”";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME 密鑰使用不相容";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME，帶有 KeyUsage 的憑證已標記 !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME，帶有空白主題名稱和無電子郵件的葉憑證 * 在 SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME，帶有空白主題名稱的葉憑證，SubjectAltName * 不重要";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "找不到合適的 SSL ExtendedKeyUsage";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "不符合語法的 OCSP 回應";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "不符合語法的 OCSP 要求";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP 服務無法使用";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP 狀態：無法辨識的憑證";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "每個憑證的撤銷檢查不成功";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "一般網路錯誤";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP 回應無法驗證錨或根";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP 回應驗證為不受信任的根";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP 回應簽名錯誤";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "未發現 OCSP 回應簽名者";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP 回應程式狀態：要求形式錯誤";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP 回應程式狀態：內部錯誤";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP 回應程式狀態：稍後再試";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP 回應程式狀態：需要簽名";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP 回應程式狀態：未經授權";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP 回應 nonce 與請求不相符";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "不合法的代碼簽名認證鑰匙圈長度";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "遺失代碼簽名基本限制";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "不正確的代碼簽名 PathLengthConstraint";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "遺失代碼簽名的 ExtendedKeyUsage";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "已偵測發展樣式代碼簽名認證";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "不合法的“資源簽署”認證鑰匙圈長度";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "不正確的 “資源簽署”延伸密鑰使用";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "信任設定：拒絕";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "無效空白的 SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "未知的重要“合格認證準則 ID”";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "憑證要求已佇列";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "憑證要求已轉址";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "一般的伺服器回報錯誤";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "伺服器回報參數錯誤";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "伺服器回報授權錯誤";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "伺服器回報尚未執行";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "伺服器回報不存在";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "伺服器回報已存在";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "伺服器回報服務錯誤";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "指定使用者的要求尚未解決";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "指定使用者沒有尚未解決的要求";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR 驗證失敗";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "伺服器報告一致性檢查失敗";

/* errSecCSUnimplemented */
"-67072" = "未實行的代碼簽名功能";

/* errSecCSInvalidObjectRef */
"-67071" = "無效的 API 物件參考";

/* errSecCSInvalidFlags */
"-67070" = "指定了無效或不適合的 API 旗標";

/* errSecCSObjectRequired */
"-67069" = "必需的指標引數為 NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "找不到磁碟中的代碼物件";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "找不到使用這種屬性設置的訪客";

/* errSecCSInvalidAttributeValues */
"-67066" = "指定的屬性值無效";

/* errSecCSNoSuchCode */
"-67065" = "主機沒有符合要求屬性的訪客";

/* errSecCSMultipleGuests */
"-67064" = "主機有多位這種屬性值的訪客";

/* errSecCSGuestInvalid */
"-67063" = "代碼識別已失效";

/* errSecCSUnsigned */
"-67062" = "代碼物件尚未簽名";

/* errSecCSSignatureFailed */
"-67061" = "代碼或簽名已修改";

/* errSecCSSignatureNotVerifiable */
"-67060" = "無法讀取簽名，因為檔案系統將 root 對應到沒有權限的使用者";

/* errSecCSSignatureUnsupported */
"-67059" = "不支援的簽名類型或版本";

/* errSecCSBadDictionaryFormat */
"-67058" = "必需的 plist 檔或資源形式不正確";

/* errSecCSResourcesNotSealed */
"-67057" = "資源未被簽名密封";

/* errSecCSResourcesNotFound */
"-67056" = "找不到代碼中的密封資源";

/* errSecCSResourcesInvalid */
"-67055" = "密封的資源目錄無效";

/* errSecCSBadResource */
"-67054" = "密封的資源遺失或無效";

/* errSecCSResourceRulesInvalid */
"-67053" = "無效的資源選擇規則";

/* errSecCSReqInvalid */
"-67052" = "無效或已損毀的代碼要求";

/* errSecCSReqUnsupported */
"-67051" = "不支援的代碼要求類型或版本";

/* errSecCSReqFailed */
"-67050" = "無法滿足代碼要求";

/* errSecCSBadObjectFormat */
"-67049" = "物件檔案格式無效或不適合";

/* errSecCSInternalError */
"-67048" = "“編碼簽署”子系統的內部錯誤";

/* errSecCSHostReject */
"-67047" = "編碼拒絕其主機";

/* errSecCSNotAHost */
"-67046" = "此代碼並非主機";

/* errSecCSSignatureInvalid */
"-67045" = "簽名檔的無效格式";

/* errSecCSHostProtocolRelativePath */
"-67044" = "違反主機通訊協定 ─ 需要絕對訪客路徑";

/* errSecCSHostProtocolContradiction */
"-67043" = "違反主機通訊協定 ─ 相衝突的主機模式";

/* errSecCSHostProtocolDedicationError */
"-67042" = "違反主機通訊協定 ─ 不允許指定的訪客操作";

/* errSecCSHostProtocolNotProxy */
"-67041" = "違反主機通訊協定 ─ 未連接代理伺服器主機";

/* errSecCSHostProtocolStateError */
"-67040" = "違反主機通訊協定 ─ 無效的訪客狀態更改要求";

/* errSecCSHostProtocolUnrelated */
"-67039" = "違反主機通訊協定 ─ 所指定的訪客不是指定主機上的訪客";

/* errSecCSInvalidOperation */
"-67038" = "要求的作業無效";

/* errSecCSNotSupported */
"-67037" = "此代碼類型不支援的作業";

/* errSecCSCMSTooLarge */
"-67036" = "簽名太大，無法嵌入";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "違反主機通訊協定 ─ 無效的訪客雜湊";

/* errSecCSStaticCodeChanged */
"-67034" = "磁碟中的程式與正在執行的程式不符合";

/* errSecCSSigDBDenied */
"-67033" = "存取簽名資料庫被拒絕";

/* errSecCSSigDBAccess */
"-67032" = "無法存取簽名資料庫";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "主機傳回無效的或不一致的訪客屬性";

/* errSecMisc_dskFulErr */
"-34" = "磁碟已滿。";

/* errSecMisc_nsvErr */
"-35" = "找不到磁碟。磁碟可能已經退出。";

/* errSecMisc_bdNamErr */
"-37" = "嘗試打開的檔案名稱包含不合法的字元。";

/* errSecMisc_fnfErr */
"-43" = "找不到此檔案。";

/* errSecMisc_wPrErr */
"-44" = "磁碟為寫入保謢。";

/* errSecMisc_fLckdErr */
"-45" = "檔案已鎖定。";

/* errSecMisc_vLckdErr */
"-46" = "卷宗已鎖定";

/* errSecMisc_fBsyErr */
"-47" = "檔案正在忙碌中。它可能正被其他應用程式使用。";

/* errSecMisc_dupFNErr */
"-48" = "已經存在一個有相同名稱的檔案。";

/* errSecMisc_opWrErr */
"-49" = "檔案已經打開且具寫入權限。";

/* errSecMisc_volOffLinErr */
"-53" = "這個卷宗無法使用。卷宗可能已經被退出。";

/* errSecMisc_permErr */
"-54" = "不能打開此檔案。它可能正被其他應用程式使用。";

/* errSecMisc_extFSErr */
"-58" = "此卷宗似乎不相容。";

/* errSecMisc_wrPermErr */
"-61" = "無法寫入此檔案。打開此檔案的存取權限可能不足。";

/* errSecMisc_offLinErr */
"-65" = "這個儲存設備已無法使用。它可能已被退出。";

/* errSecMisc_dirNFErr */
"-120" = "找不到目錄。";

/* errSecMisc_volGoneErr */
"-124" = "伺服器卷宗無法使用。其連線可能已經中斷。";

/* errSecMisc_userCanceledErr */
"-128" = "使用者已經取消操作。";

/* errSecMisc_resNotFound */
"-192" = "找不到所需資源。";

/* errSecMisc_resFNotFound */
"-193" = "所需的資源遺失或毀損。";

/* errSecMisc_icNoURLErr */
"-673" = "指定位置（URL）是未知的類型，或沒有包含足夠的資訊。";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "找不到打開指定 URL 的輔助說明應用程式。";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "此項目的位置（URL）已遺失或是格式不正確。";

/* errSecMisc_afpAccessDenied */
"-5000" = "這個項目的存取權限被拒絕。";

/* errSecMisc_afpUserNotAuth */
"-5023" = "認證失敗。該項目加到鑰匙圈後，此伺服器的密碼可能已經改變。";

